using Tyuiu.MolokanovNK.Sprint1.Task7.V10.Lib;

namespace Tyuiu.MolokanovNK.Sprint1.Task7.V10
{
    class Programm
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #1 | Выполнил : Молоканов Н. К. | ИБКСб-25-1";
            //Длина строки 75 символов
            Console.WriteLine("**********************************************************************************************************");
            Console.WriteLine("* Спринт #1                                                                                              *");
            Console.WriteLine("* Тема: Базовые навыки работы в C#                                                                       *");
            Console.WriteLine("* Задание #7                                                                                             *");
            Console.WriteLine("* Вариант #10                                                                                            *");
            Console.WriteLine("* Выполнил: Молоканов Никита Константинович | ИБКСб-25-1                                                 *");
            Console.WriteLine("**********************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                               *");
            Console.WriteLine("* Написать программу, которая вычисляет математическое выражение по исходным значениям данных,           *");
            Console.WriteLine("* вводимых пользователем. Ответ округлите до 3 знаков после запятой.                                     *");
            Console.WriteLine("*                                                                                                        *");
            Console.WriteLine("**********************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                       *");
            Console.WriteLine("**********************************************************************************************************");

            double x;
            

            Console.WriteLine("Введите переменную X:");
            x = double.Parse(Console.ReadLine());
            

            Console.WriteLine("**********************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                             *");
            Console.WriteLine("**********************************************************************************************************");

            Console.WriteLine("Ответ формулы равен = " + ds.Calculate(x));
            Console.ReadLine();
        }
    }
}
